{"format": "layers-model", "generatedBy": "keras v3.13.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.13.0", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_1", "optional": false}}, {"class_name": "Functional", "config": {"name": "xception", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer", "optional": false}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}}, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 224, 224, 3]}, "name": "block1_conv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 224, 224, 3], "dtype": "float32", "keras_history": ["input_layer", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block1_conv1_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 111, 111, 32]}, "name": "block1_conv1_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 111, 111, 32], "dtype": "float32", "keras_history": ["block1_conv1", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block1_conv1_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block1_conv1_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 111, 111, 32], "dtype": "float32", "keras_history": ["block1_conv1_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block1_conv2", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 111, 111, 32]}, "name": "block1_conv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 111, 111, 32], "dtype": "float32", "keras_history": ["block1_conv1_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block1_conv2_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 109, 109, 64]}, "name": "block1_conv2_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 109, 109, 64], "dtype": "float32", "keras_history": ["block1_conv2", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block1_conv2_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block1_conv2_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 109, 109, 64], "dtype": "float32", "keras_history": ["block1_conv2_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SeparableConv2D", "config": {"name": "block2_sepconv1", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "depth_multiplier": 1, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 109, 109, 64]}, "name": "block2_sepconv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 109, 109, 64], "dtype": "float32", "keras_history": ["block1_conv2_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block2_sepconv1_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 109, 109, 128]}, "name": "block2_sepconv1_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 109, 109, 128], "dtype": "float32", "keras_history": ["block2_sepconv1", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block2_sepconv2_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block2_sepconv2_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 109, 109, 128], "dtype": "float32", "keras_history": ["block2_sepconv1_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SeparableConv2D", "config": {"name": "block2_sepconv2", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "depth_multiplier": 1, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 109, 109, 128]}, "name": "block2_sepconv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 109, 109, 128], "dtype": "float32", "keras_history": ["block2_sepconv2_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block2_sepconv2_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 109, 109, 128]}, "name": "block2_sepconv2_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 109, 109, 128], "dtype": "float32", "keras_history": ["block2_sepconv2", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 109, 109, 64]}, "name": "conv2d", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 109, 109, 64], "dtype": "float32", "keras_history": ["block1_conv2_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "block2_pool", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 109, 109, 128], "dtype": "float32", "keras_history": ["block2_sepconv2_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 55, 55, 128]}, "name": "batch_normalization", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 55, 55, 128], "dtype": "float32", "keras_history": ["conv2d", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Add", "config": {"name": "add", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}}, "build_config": {"input_shape": [[null, 55, 55, 128], [null, 55, 55, 128]]}, "name": "add", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 55, 55, 128], "dtype": "float32", "keras_history": ["block2_pool", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 55, 55, 128], "dtype": "float32", "keras_history": ["batch_normalization", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "block3_sepconv1_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block3_sepconv1_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 55, 55, 128], "dtype": "float32", "keras_history": ["add", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SeparableConv2D", "config": {"name": "block3_sepconv1", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "depth_multiplier": 1, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 55, 55, 128]}, "name": "block3_sepconv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 55, 55, 128], "dtype": "float32", "keras_history": ["block3_sepconv1_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block3_sepconv1_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 55, 55, 256]}, "name": "block3_sepconv1_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 55, 55, 256], "dtype": "float32", "keras_history": ["block3_sepconv1", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block3_sepconv2_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block3_sepconv2_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 55, 55, 256], "dtype": "float32", "keras_history": ["block3_sepconv1_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SeparableConv2D", "config": {"name": "block3_sepconv2", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "depth_multiplier": 1, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 55, 55, 256]}, "name": "block3_sepconv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 55, 55, 256], "dtype": "float32", "keras_history": ["block3_sepconv2_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block3_sepconv2_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 55, 55, 256]}, "name": "block3_sepconv2_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 55, 55, 256], "dtype": "float32", "keras_history": ["block3_sepconv2", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 55, 55, 128]}, "name": "conv2d_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 55, 55, 128], "dtype": "float32", "keras_history": ["add", 0, 0]}}], "kwargs": {}}]}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "block3_pool", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 55, 55, 256], "dtype": "float32", "keras_history": ["block3_sepconv2_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 28, 28, 256]}, "name": "batch_normalization_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 256], "dtype": "float32", "keras_history": ["conv2d_1", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}}, "build_config": {"input_shape": [[null, 28, 28, 256], [null, 28, 28, 256]]}, "name": "add_1", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 256], "dtype": "float32", "keras_history": ["block3_pool", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 256], "dtype": "float32", "keras_history": ["batch_normalization_1", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "block4_sepconv1_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block4_sepconv1_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 256], "dtype": "float32", "keras_history": ["add_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SeparableConv2D", "config": {"name": "block4_sepconv1", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "depth_multiplier": 1, "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 28, 28, 256]}, "name": "block4_sepconv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 256], "dtype": "float32", "keras_history": ["block4_sepconv1_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block4_sepconv1_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 28, 28, 728]}, "name": "block4_sepconv1_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 728], "dtype": "float32", "keras_history": ["block4_sepconv1", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block4_sepconv2_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block4_sepconv2_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 728], "dtype": "float32", "keras_history": ["block4_sepconv1_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SeparableConv2D", "config": {"name": "block4_sepconv2", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "depth_multiplier": 1, "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 28, 28, 728]}, "name": "block4_sepconv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 728], "dtype": "float32", "keras_history": ["block4_sepconv2_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block4_sepconv2_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 28, 28, 728]}, "name": "block4_sepconv2_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 728], "dtype": "float32", "keras_history": ["block4_sepconv2", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "filters": 728, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 28, 28, 256]}, "name": "conv2d_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 256], "dtype": "float32", "keras_history": ["add_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "block4_pool", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 728], "dtype": "float32", "keras_history": ["block4_sepconv2_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "batch_normalization_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["conv2d_2", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}}, "build_config": {"input_shape": [[null, 14, 14, 728], [null, 14, 14, 728]]}, "name": "add_2", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block4_pool", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["batch_normalization_2", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "block5_sepconv1_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block5_sepconv1_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["add_2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SeparableConv2D", "config": {"name": "block5_sepconv1", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "depth_multiplier": 1, "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block5_sepconv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block5_sepconv1_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block5_sepconv1_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block5_sepconv1_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block5_sepconv1", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block5_sepconv2_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block5_sepconv2_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block5_sepconv1_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SeparableConv2D", "config": {"name": "block5_sepconv2", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "depth_multiplier": 1, "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block5_sepconv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block5_sepconv2_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block5_sepconv2_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block5_sepconv2_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block5_sepconv2", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block5_sepconv3_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block5_sepconv3_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block5_sepconv2_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SeparableConv2D", "config": {"name": "block5_sepconv3", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "depth_multiplier": 1, "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block5_sepconv3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block5_sepconv3_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block5_sepconv3_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block5_sepconv3_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block5_sepconv3", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}}, "build_config": {"input_shape": [[null, 14, 14, 728], [null, 14, 14, 728]]}, "name": "add_3", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block5_sepconv3_bn", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["add_2", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "block6_sepconv1_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block6_sepconv1_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["add_3", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SeparableConv2D", "config": {"name": "block6_sepconv1", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "depth_multiplier": 1, "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block6_sepconv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block6_sepconv1_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block6_sepconv1_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block6_sepconv1_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block6_sepconv1", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block6_sepconv2_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block6_sepconv2_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block6_sepconv1_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SeparableConv2D", "config": {"name": "block6_sepconv2", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "depth_multiplier": 1, "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block6_sepconv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block6_sepconv2_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block6_sepconv2_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block6_sepconv2_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block6_sepconv2", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block6_sepconv3_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block6_sepconv3_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block6_sepconv2_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SeparableConv2D", "config": {"name": "block6_sepconv3", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "depth_multiplier": 1, "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block6_sepconv3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block6_sepconv3_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block6_sepconv3_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block6_sepconv3_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block6_sepconv3", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}}, "build_config": {"input_shape": [[null, 14, 14, 728], [null, 14, 14, 728]]}, "name": "add_4", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block6_sepconv3_bn", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["add_3", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "block7_sepconv1_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block7_sepconv1_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["add_4", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SeparableConv2D", "config": {"name": "block7_sepconv1", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "depth_multiplier": 1, "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block7_sepconv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block7_sepconv1_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block7_sepconv1_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block7_sepconv1_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block7_sepconv1", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block7_sepconv2_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block7_sepconv2_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block7_sepconv1_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "SeparableConv2D", "config": {"name": "block7_sepconv2", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "depth_multiplier": 1, "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block7_sepconv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block7_sepconv2_act", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "block7_sepconv2_bn", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "build_config": {"input_shape": [null, 14, 14, 728]}, "name": "block7_sepconv2_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 728], "dtype": "float32", "keras_history": ["block7_sepconv2", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "block7_sepconv3_act", "trainable": false, "dtype": {"class_name": "DTypePolicy", "config": {"name": "float32"}, "shared_object_id": 6389291280}, "activation": "relu"}, "name": "block7_sepconv3_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 